# GetColumnWidthInPixels Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableSectionData..::..GetColumnWidthInPixels Method
TableSectionData Class See Also
---
This returns a column's width in logical pixels
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int GetColumnWidthInPixels(
	int nCol
)
```

Visual Basic
---
```text
Public Function GetColumnWidthInPixels ( _
	nCol As Integer _
) As Integer
```

Visual C++
---
```text
public:
int GetColumnWidthInPixels(
	int nCol
)
```

# ### Parameters
nCol
    Type: System..::..Int32
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given column number nCol is invalid. |

# See Also
TableSectionData Class
Autodesk.Revit.DB Namespace